bibidentuhanoi/P4autoBoat/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_VL53L5CX_NB_TARGET_PER_ZONE=4
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FLASH_COCO_DETECT_YOLO11N_320_S8_V3=y
CONFIG_COCO_DETECT_YOLO11N_320_S8_V3=y
CONFIG_COCO_DETECT_MODEL_IN_FLASH_PARTITION=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32

# --- LWIP tuning for stability over ESP-Hosted ---
# 64KB TCP buffers exhausted internal SRAM → heap corruption under concurrent
# MJPEG + WebSocket traffic.  4×MSS (5744) is sufficient for chunked MJPEG
# and 13KB protobuf frames while keeping ~170KB of internal heap free.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=8192
CONFIG_LWIP_TCP_MSL=6000
CONFIG_LWIP_TCP_OVERSIZE_MSS=y

# --- Let lwip fall back to PSRAM when internal SRAM is tight ---
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Heap poisoning (light) — catches corruption early, ~2% overhead ---
CONFIG_HEAP_POISONING_LIGHT=y

# --- Disable WiFi power save for lower latency / fewer drops ---
CONFIG_ESP_WIFI_PS_NONE=y
